[
    {
      "bookId": 1,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/G5kqpzS/book1.jpg",
      "review": "A timeless classic that delves into the complexities of wealth, love, and the American Dream.The Great Gatsby is a timeless classic that delves into the complexities of wealth, love, and the American Dream. Set in the prosperous Jazz Age of the 1920s, the story follows the enigmatic Jay Gatsby and his obsession with the beautiful Daisy Buchanan. Through the eyes of narrator Nick Carraway, readers are drawn into a world of opulence, decadence, and moral ambiguity.Fitzgerald's prose is elegant and evocative, painting a vivid portrait of the Roaring Twenties and the characters who inhabit it. The novel explores themes of love, desire, betrayal, and the relentless pursuit of the elusive American Dream. Despite its glamorous facade, the world of Gatsby is ultimately one of disillusionment and tragedy.At its core, The Great Gatsby is a cautionary tale about the emptiness of materialism and the fleeting nature of happiness. Through its rich symbolism and nuanced characters, the novel offers profound insights into the human condition and the fragile nature of human relationships.With its haunting prose and timeless themes, The Great Gatsby remains as relevant today as it was nearly a century ago. It is a masterpiece of American literature that continues to captivate readers with its tragic beauty and enduring relevance",
      "totalPages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classics", "Romance"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 2,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/SXtvTB2/to-kill-mockingbird-0-6246f05d04644ae5ba1a02409d943a13.jpg",
      "review": "A poignant tale that tackles themes of racial injustice and moral growth in a small Southern town.To Kill a Mockingbird is a Pulitzer Prize-winning novel written by Harper Lee and published in 1960. Here's a review for the book:Harper Lee's To Kill a Mockingbird is a poignant and powerful exploration of racial injustice, moral growth, and the complexities of human nature. Set in the racially charged atmosphere of the Deep South during the 1930s, the novel follows young Scout Finch as she navigates the harsh realities of prejudice and discrimination in her small town of Maycomb, Alabama.At the heart of the story is the trial of Tom Robinson, a black man falsely accused of raping a white woman. Through the eyes of Scout and her brother Jem, readers witness the injustices of the segregated society in which they live, as well as the courage and integrity of their father, Atticus Finch, who serves as Tom's defense attorney.",
      "totalPages": 336,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Social Justice", "Coming of Age"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 3,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/XLPy3F3/book3.jpg",
      "review": "A chilling portrayal of a dystopian society where freedom is suppressed and surveillance is omnipresent.1984 by George Orwell is a chilling and prophetic dystopian novel that remains as relevant today as it was when it was first published in 1949. Here's a review for the book:Set in a totalitarian society ruled by the oppressive Party led by the enigmatic figure known as Big Brother, 1984 paints a bleak portrait of a world where individuality and freedom are systematically eradicated in the name of maintaining absolute power. The story follows Winston Smith, a low-ranking member of the Party who begins to question the oppressive regime and seek out truth and rebellion in a world where even thoughts are monitored and controlled.Orwell's vision of a surveillance state where privacy is nonexistent and truth is manipulated to serve the interests of the ruling elite is both haunting and thought-provoking. Through vivid prose and sharp social commentary, he explores themes of censorship, propaganda, and the dangers of unchecked government authority. The novel's depiction of a society where language is weaponized to distort reality and suppress dissent is as disturbing as it is compelling.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Dystopian", "Political"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 4,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/Qk7Kgym/book4.jpg",
      "review": "A coming-of-age novel that captures the angst and alienation of adolescence. The Catcher in the Rye by J.D. Salinger is a seminal work of American literature that has captivated readers since its publication in 1951. Here's a review for the book:At its core, The Catcher in the Rye is a coming-of-age novel that follows the experiences of Holden Caulfield, a disillusioned teenager struggling to navigate the complexities of adolescence and the adult world. The story unfolds over the course of a few days, as Holden embarks on a journey of self-discovery and introspection following his expulsion from yet another prestigious prep school.Salinger's masterful prose and unique narrative voice draw readers into Holden's world, allowing them to experience his innermost thoughts, fears, and frustrations. Through Holden's candid and often irreverent narration, Salinger explores themes of alienation, identity, and the search for meaning in a world that often seems indifferent and incomprehensible.",
      "totalPages": 224,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Young Adult", "Existential"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 5,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/hHzLxqV/bo5.jpg",
      "review": "A timeless romance that explores the complexities of love, class, and societal expectations.Pride and Prejudice by Jane Austen is a timeless classic of English literature, first published in 1813. Here's a review for the book:Pride and Prejudice is a delightful and witty comedy of manners that explores themes of love, marriage, and social class in Regency-era England. The novel follows the story of the spirited and independent Elizabeth Bennet as she navigates the complexities of romance and societal expectations in a world governed by strict social norms and conventions.Austen's sparkling prose and keen observations of human nature bring the characters and settings of Pride and Prejudice vividly to life. From the lively exchanges of the Bennet family to the elegant ballrooms of high society, Austen's portrayal of Georgian England is both charming and incisive, offering readers a window into a bygone era filled with wit, romance, and intrigue.",
      "totalPages": 432,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Romance", "Social Commentary"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 6,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/Qfk7cMC/book6.jpg",
      "review": "An enchanting adventure filled with memorable characters and epic quests. The Hobbit by J.R.R. Tolkien is a beloved fantasy adventure novel that has enchanted readers of all ages since its publication in 1937. Here's a review for the book:The Hobbit follows the journey of Bilbo Baggins, a hobbit who is swept away from his quiet life in the Shire and thrust into a grand adventure beyond his wildest dreams. Recruited by the wizard Gandalf and a band of dwarves led by Thorin Oakenshield, Bilbo embarks on a quest to reclaim the lost kingdom of Erebor and its treasure from the fearsome dragon Smaug.Tolkien's masterful storytelling and rich imagination bring the world of Middle-earth to life, from the rolling hills of the Shire to the misty mountains and dark forests that lie beyond. Through vivid descriptions and vivid imagery, Tolkien transports readers to a realm filled with magic, danger, and wonder, where heroes and villains clash in epic battles and ancient prophecies are fulfilled.",
      "totalPages": 310,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Adventure", "Epic Fantasy"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1937
    }
  ]
  